Repository: alextselegidis/easyappointments-integrations
Catalog: languages/easyappointments-*.po
Languages: ru_ru

source: Easy!Appointments files were installed successfully! Navigate to your installation URL complete the configuration of the application.
ru_ru: Файлы Easy!Appointments были успешно установлены! Перейдите на URL-адрес вашей установки и завершите настройку приложения.

source: Easy!Appointments installation was linked successfully! You can now use the [easyappointments] shortcode in your pages.
ru_ru: Установка Easy!Appointments была привязана успешно! Теперь вы можете использовать шорткод [easyappointments] на своих страницах.

source: Easy!Apppointments installation was unlinked successfully!
ru_ru: Установка Easy!Apppointments была успешно отвязана!

source: Easy!Appointments link is active! Use the [easyappointments] shortcode in your pages/posts.
ru_ru: Ссылка Easy!Appointments активна! Используйте шорткод [easyappointments] на своих страницах/постах.

source: Easy!Appointments link seems to be broken! Make sure Easy!Appointments files are located in the target directory.
ru_ru: Ссылка Easy!Appointments кажется нерабочей! Убедитесь, что файлы Easy!Appointments находятся в целевом каталоге.

source: An unexpected error occurred in file %file% (line %line%): %message%
ru_ru: В файле %file% (строка %line%) произошла непредвиденная ошибка: %message%

source: The AJAX request could not be completed due to an unexpected error: %message%
ru_ru: AJAX-запрос не может быть завершен из-за непредвиденной ошибки: %message%

source: Integrate the booking form of Easy!Appointments directly into your WordPress pages. This plugin will let you create a new Easy!Appointments installation or use an existing one directly from the WordPress back-end section. Add the [easyappointments] shortcode into your pages and leverage your conversion rates.
ru_ru: Интегрируйте форму бронирования Easy!Appointments непосредственно в ваши страницы WordPress. Этот плагин позволит вам создать новую установку Easy!Appointments или использовать существующую прямо из внутреннего раздела WordPress. Добавьте шорткод [easyappointments] на свои страницы и повысьте конверсию.

source: Hints
ru_ru: Советы

source: Troubleshooting
ru_ru: Устранение неисправностей

source: About
ru_ru: О компании

source: Connection Information
ru_ru: Информация о подключении

source: Set the path and URL of your Easy!Appointments installation and press either the "Install" or "Link" button to proceed with the operation.
ru_ru: Задайте путь и URL вашей установки Easy!Appointments и нажмите кнопку "Установить" или "Связать" для продолжения операции.

source: Path
ru_ru: Путь

source: Example
ru_ru: Пример

source: * Make sure that the target directory exists on the server and it's writable.
ru_ru: * Убедитесь, что целевой каталог существует на сервере и доступен для записи.

source: Install
ru_ru: Установить

source: Link
ru_ru: Связать

source: Remove Easy!Appointments Files
ru_ru: Удалить файлы Easy!Appointments

source: Remove Easy!Appointments Database Tables
ru_ru: Удаление таблиц базы данных Easy!Appointments

source: Unlink
ru_ru: Отвязать

source: These actions cannot be undone!
ru_ru: Эти действия невозможно отменить!

source: This operation will create a new installation by placing and configuring Easy!Appointments files into the requested directory. You will have to complete the installation by opening the target URL in your browser.
ru_ru: Эта операция создаст новую установку, поместив и настроив файлы Easy!Appointments в указанную директорию. Вы должны будете завершить установку, открыв целевой URL в браузере.

source: This operation will connect an existing Easy!Appointments installation and your WordPress website. Make sure that you use the correct installation path and URL of Easy!Appointments.
ru_ru: Эта операция соединит существующую установку Easy!Appointments и ваш сайт WordPress. Убедитесь, что вы используете правильный путь установки и URL Easy!Appointments.

source: This operation will unlink an active connection between Easy!Appointments and your WordPress website. You can remove the files and database tables as well, even though this is optional.
ru_ru: Эта операция отвяжет активное соединение между Easy!Appointments и вашим сайтом WordPress. Вы можете также удалить файлы и таблицы базы данных, хотя это необязательно.

source: Shortcode
ru_ru: Шорткод

source: Display the booking form directly in your pages or posts by adding the [easyappointments] shortcode. This shortcode accepts some optional attributes that will change its appearance. These attibutes are "width", "height", "style" and will be applied automatically to the parent container element (e.g. [easyappointments width="500px" height="300px" style="border: 2px solid black"]).
ru_ru: Отобразите форму бронирования непосредственно на страницах или в сообщениях, добавив шорткод [easyappointments]. Этот шорткод принимает некоторые необязательные атрибуты, которые изменят его внешний вид. Эти атрибуты - "width", "height", "style" - будут автоматически применены к родительскому элементу контейнера (например, [easyappointments width="500px" height="300px" style="border: 2px solid black"]).

source: Permission Problems
ru_ru: Проблемы с разрешениями

source: Some plugin operations perform various filesystem tasks that might be interrupted due to lack of permissions. This issues mostly happen in Unix environments because PHP does not have the required permissions to read/write/delete files or directories. If you cannot solve the problem try to continue the operation manually with an FTP user (e.g. if the "Install" operation fails, upload the latest Easy!Appointments version manually and connect it with WordPress with the "Link" operation).
ru_ru: Некоторые операции плагина выполняют различные задачи файловой системы, которые могут быть прерваны из-за отсутствия прав доступа. Такие проблемы чаще всего возникают в Unix-окружении, поскольку PHP не имеет необходимых прав на чтение/запись/удаление файлов или каталогов. Если вы не можете решить проблему, попробуйте продолжить операцию вручную с помощью FTP-пользователя (например, если операция "Установить" не удалась, загрузите последнюю версию Easy!Appointments вручную и соедините ее с WordPress с помощью операции "Связать").

source: Broken Connection
ru_ru: Соединение прервано

source: If this settings page notifies you of a broken Easy!Appointments connection it could be that the Easy!Appointments files where moved or the installation URL was changed and the connection couldn't be verified. "Unlink" the current connection without removing the files or database tables and then "Link" it again with the new information.
ru_ru: Если эта страница настроек уведомляет вас о разрыве соединения Easy!Appointments, это может быть связано с тем, что файлы Easy!Appointments были перемещены или URL установки был изменен, и соединение не может быть проверено. "Отвяжите" текущее соединение, не удаляя файлы или таблицы базы данных, а затем "Свяжите" его снова с новой информацией.

source: Support Forum
ru_ru: Форум поддержки

source: If you encounter issues but you do not know what to do visit the official Easy!Appointments support group where active users help each other solve their problems.
ru_ru: Если у вас возникли проблемы, но вы не знаете, что делать, посетите официальную группу поддержки Easy!Appointments, где активные пользователи помогают друг другу решить проблемы.

source: Support Group
ru_ru: Группа поддержки

source: Easy!Appointments - WordPress Plugin
ru_ru: Easy!Appointments - Плагин WordPress

source: Leverage your conversion rates by integrating the booking form directly in your WordPress pages. Customers will never have to leave your website for booking an appointment. Take advantage of the scheduling power of Easy!Appointment which will run smoothly with your WordPress installation.Include the booking form in your pages with the [easyappointments] shortcode.
ru_ru: Повысьте коэффициент конверсии, интегрировав форму бронирования непосредственно в страницы вашего WordPress. Клиентам никогда не придется покидать ваш сайт для бронирования встречи. Воспользуйтесь возможностями планирования Easy!Appointment, которые будут работать без проблем с вашей установкой WordPress. Включите форму бронирования на свои страницы с помощью шорткода [easyappointments].

source: Get Involved
ru_ru: Принять участие

source: Found a problem or want to add a new feature? Contributors are more than welcome so feel free to file an issue or make pull requests on the GitHub page of the plugin.
ru_ru: Нашли проблему или хотите добавить новую функцию? Участие более чем приветствуются, так что не стесняйтесь заявить о проблеме или сделать запрос на исправление на странице плагина на GitHub.

source: For more information visit the official website of the project at
ru_ru: Для получения дополнительной информации посетите официальный сайт проекта по адресу
